; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v8 - type_1 ?v1 - type_2)
 	      (pred_3 ?v4 - object ?v1 - type_2)
	      (pred_2 ?v8 - type_1 ?v6 - type_3)
	      (pred_1 ?v8 - type_1 ?v4 - object ?v6 - type_3))

   (:action op_2
       :parameters  (?v8 - type_1 ?v3 ?v5 - type_2)
       :precondition (and  (pred_4 ?v8 ?v3))
       :effect (and  (pred_4 ?v8 ?v5)
		     (not (pred_4 ?v8 ?v3))))

   (:action op_1
       :parameters (?v8 - type_1 ?v2 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v7) (pred_4 ?v8 ?v7) (pred_2 ?v8 ?v6))
       :effect (and (pred_1 ?v8 ?v2 ?v6)
		    (not (pred_3 ?v2 ?v7)) 
		    (not (pred_2 ?v8 ?v6))))

   (:action op_3
       :parameters (?v8 - type_1 ?v2 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v2 ?v6) (pred_4 ?v8 ?v7))
       :effect (and (pred_3 ?v2 ?v7)
		    (pred_2 ?v8 ?v6)
		    (not (pred_1 ?v8 ?v2 ?v6)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_06 obj_01 - type_1
obj_05 obj_10 obj_07 obj_04 - type_3
obj_09 obj_03 obj_11 - type_2
obj_08 obj_02 - object)
(:init
(pred_4 obj_06 obj_09)
(pred_2 obj_06 obj_05)
(pred_2 obj_06 obj_10)
(pred_4 obj_01 obj_11)
(pred_2 obj_01 obj_07)
(pred_2 obj_01 obj_04)
(pred_3 obj_08 obj_11)
(pred_3 obj_02 obj_09)
)
(:goal
(and
(pred_3 obj_08 obj_11)
(pred_3 obj_02 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_06 obj_11)))
)
)

; plan
1. (op_2 obj_01 obj_11 obj_09)
   deleted: (pred_4 obj_01 obj_11)
   added: (pred_4 obj_01 obj_09)
   goals met: 1 of 2
2. (op_1 obj_01 obj_02 obj_09 obj_04)
   deleted: (pred_3 obj_02 obj_09) (pred_2 obj_01 obj_04)
   added: (pred_1 obj_01 obj_02 obj_04)
   goals met: 1 of 2
3. (op_2 obj_01 obj_09 obj_11)
   deleted: (pred_4 obj_01 obj_09)
   added: (pred_4 obj_01 obj_11)
   goals met: 1 of 2
4. (op_3 obj_01 obj_02 obj_11 obj_04)
   deleted: (pred_1 obj_01 obj_02 obj_04)
   added: (pred_3 obj_02 obj_11) (pred_2 obj_01 obj_04)
   goals met: 2 of 2
